Autodesk.Revit.DB.Mechanical.AirSystemData.IsValidObject
Specifies whether the .NET object represents a valid Revit entity.
Remarks:
If the corresponding Revit native object is destroyed, or creation of the corresponding object is undone,
a managed API object containing it is no longer valid. API methods cannot be called on invalidated wrapper objects.
Returns:
True if the API object holds a valid Revit native object, false otherwise.
Since:
2014

Autodesk.Revit.DB.Mechanical.AirSystemData.AirFanType
The fan type.
Throws Autodesk.Revit.Exceptions.ArgumentOutOfRangeException:
When setting this property: A value passed for an enumeration argument is not a member of that enumeration
Since:
2020.1

Autodesk.Revit.DB.Mechanical.AirSystemData.ChilledWaterLoopId
The chilled water loop used for the chilled water option of cooling coil.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
When setting this property: A non-optional argument was null
Since:
2020.1

Autodesk.Revit.DB.Mechanical.AirSystemData.CoolingCoilType
The cooling coil type. Note this property change would reset the chilled water loop.
Throws Autodesk.Revit.Exceptions.ArgumentOutOfRangeException:
When setting this property: A value passed for an enumeration argument is not a member of that enumeration
Since:
2020.1

Autodesk.Revit.DB.Mechanical.AirSystemData.HeatingHotWaterLoopId
The water loop element id for the hot-water heating coil.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
When setting this property: A non-optional argument was null
Since:
2020.1

Autodesk.Revit.DB.Mechanical.AirSystemData.HeatingCoilType
The heating coil type. Note this property change would reset the heating water loop.
Throws Autodesk.Revit.Exceptions.ArgumentOutOfRangeException:
When setting this property: A value passed for an enumeration argument is not a member of that enumeration
Since:
2020.1

Autodesk.Revit.DB.Mechanical.AirSystemData.PreheatHotWaterLoopId
The water loop element id for the hot-water preheat coil.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
When setting this property: A non-optional argument was null
Since:
2020.1

Autodesk.Revit.DB.Mechanical.AirSystemData.PreheatCoilType
The preheat coil type. Note this property change would reset the preheat water loop.
Throws Autodesk.Revit.Exceptions.ArgumentOutOfRangeException:
When setting this property: A value passed for an enumeration argument is not a member of that enumeration
Since:
2020.1

Autodesk.Revit.DB.Mechanical.AirSystemData.HeatExchangerType
The type of heat exchanger.
Throws Autodesk.Revit.Exceptions.ArgumentOutOfRangeException:
When setting this property: A value passed for an enumeration argument is not a member of that enumeration
Since:
2020.1

Autodesk.Revit.DB.Mechanical.AirSystemData
Represents the data and parameter of analytical air system.
Since:
2020.1